app/controllers/boxes_controller.rb

SELECT "boxes".* FROM "boxes"
---
	def index
		@boxes = Box.all

SELECT  "boxes".* FROM "boxes" WHERE "boxes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_box
		@box = Box.find(params[:id])