app/controllers/users_controller.rb

INSERT INTO "users" ("name", "happiness", "pollution", "limit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "pat"], ["happiness", 0], ["pollution", 0], ["limit", 9], ["created_at", "2017-08-09 15:13:34.838227"], ["updated_at", "2017-08-09 15:13:34.838227"]]
SELECT "users".* FROM "users"
---
	def create
		@user = User.create(user_params)
		@users = User.all